In [42]:
# Scaling --> to scale down the values for better performance of ML algos
# Scaling --> two types --- 1. Standard Scaling --> Salary
# 2. MinMax Scaler

# It's a permanent step 

# 1. Standard Scaling (formula) --> [x-u(mean)/sigma]
# 2. MinMax Scaler (formula) --> [x-x(min)/x(max)-x(min)]

# Scaling is working only "Numerical Data"

In [43]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as ex
import warnings

warnings.filterwarnings("ignore")

In [44]:
df = pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [45]:
df1 = df[['Age', 'EstimatedSalary']]

In [46]:
df1.describe()

              Age  EstimatedSalary
count  400.000000       400.000000
mean    37.655000     69742.500000
std     10.482877     34096.960282
min     18.000000     15000.000000
25%     29.750000     43000.000000
50%     37.000000     70000.000000
75%     46.000000     88000.000000
max     60.000000    150000.000000

In [47]:
# Standard   ---> mean = 0, std = 1
from sklearn.preprocessing import StandardScaler

In [48]:
sc = StandardScaler()

In [49]:
df2_sc = sc.fit_transform(df1)

In [50]:
df3 = pd.DataFrame(df2_sc, columns = ['Age', 'EstimatedSalary'])

In [51]:
np.round(df3.describe(),2)

          Age  EstimatedSalary
count  400.00           400.00
mean    -0.00            -0.00
std      1.00             1.00
min     -1.88            -1.61
25%     -0.76            -0.79
50%     -0.06             0.01
75%      0.80             0.54
max      2.13             2.36

In [52]:
######################################################################################################33

In [53]:
# Work on other data same as

In [54]:
df1 = pd.read_csv('salary_data.csv')
df1.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [55]:
df2 = df1[['YearsExperience', 'Salary']]

In [56]:
df2.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [57]:
# Standard   ---> mean = 0, std = 1
from sklearn.preprocessing import StandardScaler

In [58]:
sc = StandardScaler()

In [59]:
df3_sc = sc.fit_transform(df2)

In [60]:
df4 = pd.DataFrame(df3_sc, columns = ['YearsExperience', 'Salary'])

In [61]:
np.round(df4.describe(),2)

       YearsExperience  Salary
count            30.00   30.00
mean             -0.00    0.00
std               1.02    1.02
min              -1.51   -1.42
25%              -0.76   -0.72
50%              -0.22   -0.40
75%               0.86    0.91
max               1.86    1.72

In [62]:
#######################################################################################################################3

In [63]:
#  Working on next dataset

In [64]:
ds = pd.read_csv("height-weight.csv")
ds.head(3)

   Weight  Height
0      45     120
1      58     135
2      48     123

In [65]:
ds1 = ds[['Weight', 'Height']]

In [66]:
ds1.describe()

           Weight      Height
count   23.000000   23.000000
mean    73.826087  158.391304
std     17.872407   19.511626
min     45.000000  120.000000
25%     59.000000  142.500000
50%     78.000000  162.000000
75%     86.000000  175.000000
max    105.000000  183.000000

In [67]:
# Standard   ---> mean = 0, std = 1
from sklearn.preprocessing import StandardScaler

In [68]:
sc = StandardScaler()

In [69]:
ds2_sc = sc.fit_transform(ds1)

In [70]:
ds3 = pd.DataFrame(ds2_sc, columns = ['Weight', 'Height'])

In [71]:
np.round(ds3.describe(),2)

       Weight  Height
count   23.00   23.00
mean     0.00   -0.00
std      1.02    1.02
min     -1.65   -2.01
25%     -0.85   -0.83
50%      0.24    0.19
75%      0.70    0.87
max      1.78    1.29